<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
   <%@ include file="includes/header.jsp"%>
         <section class="features-icons bg-light text-center">
        <div class="row">
        	<div class="col">
        	<div class="card h-50 board">
        		<div class="card-body">
        			<a href="/noticeboard/nboard" class="alink"><h2>공지사항</h2></a><hr/>
        			<table class="table table-hover">
        		<thead>
			<tr>
				<th></th>
				<th>제목</th>
				<th>작성자</th>
				<th>작성일</th>
				<th>조회수</th>
			</tr>
		</thead>
		<tbody>
			<c:forEach items="${nboards.content}" var="nboard" varStatus="st">
				<tr>
					<td></td>
					<td><a href="/noticeboard/view/${nboard.nbnum}">${nboard.nbtitle }</a></td>
					<td>${nboard.member.id }</td>
					<td><fmt:formatDate value="${nboard.nbregdate}"
							pattern="yyyy-MM-dd" /> <%--  /${nboard.nbregdate }  --%></td>
					<td>${nboard.nbhitcnt }</td>
				</tr>
			</c:forEach>
		</tbody>
		</table>
		
        		</div>
        		  <div class="card-footer"></div>
        		</div>
        		  
        	<div class="card h-50 board">	
        		<div class="card-body">
        			<a href="/freeboard/board" class="alink"><h2>자유게시판</h2></a><hr/>
        			<table class="table table-hover">
		<thead>
			<tr>
				<th></th>
				<th>제목</th>
				<th>작성자</th>
				<th>작성일</th>
				<th>조회수</th>
			</tr>
		</thead>
		<tbody>
			<c:forEach items="${boards.content}" var="board" varStatus="st">
				<tr>
					<td></td>
					<td><a href="/freeboard/view/${board.num}">(${board.free })${board.title }</a></td>
					<td>${board.member.id }</td>
		
					<td><fmt:formatDate value="${board.regdate}"
							pattern="yyyy-MM-dd" /> <%--  /${board.regdate }  --%></td>
					<td>${board.hitcnt }</td>
				</tr>
			</c:forEach>
		</tbody>
		</table>
        		</div>
        	</div>
        	
        	</div>
        	<div class="col">
                    <div class="card h-150">
                    
                        <div class="card-body">
                              <img src="../assets/img/map.png" usemap="#image-map">
                    	<!-- 기장 -->
                    	<map name="image-map">
    						 <area target="" alt="기장군" title="기장군" href="/tour/gijang" coords="806,415,799,399,793,397,785,378,769,369,755,385,742,357,719,358,708,353,713,343,717,322,711,303,693,282,678,282,665,256,646,249,644,232,655,206,656,190,628,170,612,153,623,128,618,110,623,99,621,90,645,82,651,77,628,47,645,45,664,51,681,59,702,76,734,77,764,60,753,21,760,12,796,42,821,42,841,36,874,34,912,77,908,119,929,128,947,147,953,159,933,167,904,161,876,163,873,180,875,210,876,237,871,250,831,266,864,289,851,305,837,334,816,346,818,372,820,405,815,410" shape="poly">
    <area target="" alt="해운대구" title="해운대구" href="/tour/haeundae" coords="806,412,799,401,792,397,787,380,771,369,759,384,747,370,739,357,719,361,707,354,715,335,719,317,703,288,681,283,670,299,662,315,647,325,637,336,630,349,629,372,635,393,650,413,660,433,667,452,710,466,719,454,730,466,749,470,775,425" shape="poly">
    <area target="" alt="금정구" title="금정구" href="/tour/geomjung" coords="567,328,601,329,623,347,639,336,643,323,665,308,679,278,668,255,653,252,642,251,646,231,653,203,656,191,610,152,604,169,584,161,561,180,540,186,516,179,505,210,519,226,508,243,507,260,519,288,516,311,538,327,554,330" shape="poly">
    <area target="" alt="동래구" title="동래구" href="/tour/dongrae" coords="537,329,574,330,602,325,616,344,626,348,626,380,605,379,587,377,570,364,539,385,524,383,512,371,526,355,531,343" shape="poly">
    <area target="" alt="연제구" title="연제구" href="/tour/yeonje" coords="523,383,537,387,551,383,564,375,576,369,589,379,612,375,630,381,636,402,626,404,616,412,607,418,601,428,599,440,582,441,577,438,577,424,569,408,556,408,544,400,529,396" shape="poly">
    <area target="" alt="수영구" title="수영구" href="/tour/suyoung" coords="630,405,620,410,614,415,604,421,600,430,599,441,604,451,607,465,621,476,633,478,633,462,645,461,655,457,658,448,649,417,641,408,635,409" shape="poly">
    <area target="" alt="영도구" title="영도구" href="/tour/youngdo" coords="523,551,508,572,492,572,499,597,525,608,530,619,543,626,548,636,562,641,567,654,586,638,588,622,569,622,570,596,542,566" shape="poly">
    <area target="" alt="남구" title="남구" href="/tour/namgu" coords="575,563,605,557,617,574,640,599,639,565,648,536,646,505,628,495,635,487,632,479,620,479,609,469,606,451,596,445,582,445,568,459,549,463,543,472,545,491,544,506,560,543" shape="poly">
    <area target="" alt="동구" title="동구" href="/tour/donggu" coords="542,470,544,484,546,503,534,508,499,514,483,508,485,490,503,481,511,469,522,467" shape="poly">
    <area target="" alt="중구" title="중구" href="/tour/junggu" coords="494,517,530,513,523,531,514,546,488,563,474,536,478,528" shape="poly">
    <area target="" alt="부산진구" title="부산진구" href="/tour/jingu" coords="508,370,472,385,465,415,471,442,467,476,483,487,500,478,508,465,524,464,539,471,546,463,572,453,580,442,570,434,571,425,572,413,555,408,545,403,524,395" shape="poly">
    <area target="" alt="북구" title="북구" href="/tour/bukgu" coords="429,370,431,353,429,335,432,311,417,286,427,269,439,242,450,219,470,212,485,212,500,207,519,222,515,234,503,244,509,256,520,279,519,301,523,316,531,324,534,329,532,344,512,365,469,388" shape="poly">
    <area target="" alt="사상구" title="사상구" href="/tour/sasang" coords="427,374,386,392,382,425,378,448,380,465,369,494,361,506,385,520,407,522,435,516,448,485,454,477,465,476,469,454,471,437,466,420,466,394" shape="poly">
    <area target="" alt="서구" title="서구" href="/tour/seogu" coords="463,478,482,490,474,515,487,518,475,530,472,543,484,563,483,579,481,594,474,606,479,629,471,648,460,633,454,605,466,593,464,566,457,552,454,533,439,518,448,493,449,481" shape="poly">
    <area target="" alt="사하구" title="사하구" href="/tour/saha" coords="361,508,351,514,346,523,351,534,351,564,345,570,358,570,371,551,381,574,378,587,375,619,381,643,403,653,421,653,414,646,423,639,435,644,439,657,451,649,447,636,441,609,447,591,455,584,456,601,463,593,462,568,454,554,450,532,438,519,435,510,415,524,383,518" shape="poly">
    <area target="" alt="강서구" title="강서구" href="/tour/gangseo" coords="110,408,103,418,116,434,120,453,146,464,165,472,174,483,165,498,182,514,181,525,153,530,161,541,169,555,179,562,186,572,205,583,199,594,183,590,152,623,142,642,122,639,122,654,126,673,126,698,143,705,138,727,151,751,175,740,168,708,178,692,193,656,237,617,254,595,265,575,278,587,291,593,309,581,305,565,331,551,342,529,340,520,358,506,356,496,365,490,374,458,377,428,380,398,382,388,426,368,423,343,426,311,406,288,365,299,316,294,304,313,286,300,263,319,226,315,220,338,239,358,242,371,232,387,241,402,233,414,227,429,225,411,217,402,203,396,186,404,173,416,119,403" shape="poly">
 </map>
                        </div>
              
                    </div>
              </div>
        </div>              
        </section>
     
<%@ include file="includes/footer.jsp"%>
